Autodesk.Revit.DB.DisciplineTypeId.Structural
Structural.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Piping
Piping.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Infrastructure
Infrastructure.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Hvac
HVAC.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Energy
Energy.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Electrical
Electrical.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Architecture
Architecture.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId.Common
Common.
Since:
2022

Autodesk.Revit.DB.DisciplineTypeId
This class contains constants identifying disciplines.
Since:
2022